Repository: SweelLong/SubtitleOverlay
Catalog: SubtitleOverlay/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: (waiting for speech…)
zh_hans: （等待语音…）

source: %@ Recognition
zh_hans: %@识别

source: %@ Translation: Models not installed
zh_hans: %@翻译：模型未安装

source: %@ Translation: Ready
zh_hans: %@翻译：就绪

source: %1$@ → %2$@ Translation
zh_hans: %1$@ → %2$@翻译

source: %1$@→%2$@ translation not supported on this device.
zh_hans: %1$@→%2$@翻译在此设备上不受支持。

source: About
zh_hans: 关于

source: App interface language. Requires app restart to take full effect.
zh_hans: 应用界面语言。需要重启应用才能完全生效。

source: Appearance
zh_hans: 外观

source: Apple Speech (On-Device)
zh_hans: Apple Speech（设备端）

source: Application
zh_hans: 应用

source: Background
zh_hans: 背景不透明度

source: Capture
zh_hans: 采集

source: Capture audio from
zh_hans: 采集音频来源

source: Checking...
zh_hans: 检查中…

source: Display
zh_hans: 显示

source: Downloading model...
zh_hans: 正在下载模型…

source: Downloading...
zh_hans: 下载中…

source: Engine
zh_hans: 引擎

source: Engines: Apple Speech (On-Device) | Whisper (Custom Model)
zh_hans: 引擎：Apple Speech（设备端）| Whisper（自定义模型）

source: Error
zh_hans: 错误

source: Failed to convert captured audio buffer.
zh_hans: 转换采集的音频缓冲区失败。

source: Font Size
zh_hans: 字体大小

source: History Lines
zh_hans: 历史行数

source: If speech recognition is unavailable, check System Settings > Privacy & Security > Screen Recording for audio capture permission, and verify the speech model for your selected language is downloaded.
zh_hans: 如果语音识别不可用，请检查系统设置 > 隐私与安全性 > 录屏与系统录音权限，并确认已下载所选语言的语音模型。

source: Import GGML Model...
zh_hans: 导入 GGML 模型…

source: Language & Translation
zh_hans: 语言与翻译

source: Language changed — restart to apply.
zh_hans: 语言已更改——重启以应用。

source: Language Configuration
zh_hans: 语言配置

source: Live Preview
zh_hans: 实时预览

source: Loading model...
zh_hans: 正在加载模型…

source: Loading...
zh_hans: 加载中…

source: Manage Speech Models in System Settings
zh_hans: 在系统设置中管理语音模型

source: Model
zh_hans: 模型

source: Model File
zh_hans: 模型文件

source: Model Management
zh_hans: 模型管理

source: Model Status
zh_hans: 模型状态

source: No model
zh_hans: 无模型

source: No model loaded
zh_hans: 未加载模型

source: No Whisper model loaded. Import a GGML model file first.
zh_hans: 未加载 Whisper 模型。请先导入 GGML 模型文件。

source: None
zh_hans: 无

source: Not Installed
zh_hans: 未安装

source: On-device models managed by macOS. All processing uses Apple Neural Engine — no data leaves your Mac.
zh_hans: 由 macOS 管理的设备端模型。所有处理使用 Apple 神经网络引擎——无数据离开您的 Mac。

source: On-device recognition active — no internet needed
zh_hans: 设备端识别已激活——无需联网

source: On-device speech recognition unavailable. Check System Settings > Privacy & Security > Speech Recognition. The speech model for your selected language must be downloaded.
zh_hans: 设备端语音识别不可用。请检查系统设置 > 隐私与安全性 > 语音识别。需要下载所选语言的语音模型。

source: Open Translation Settings
zh_hans: 打开翻译设置

source: Powered by Apple Speech & Translation frameworks. All processing stays on-device.
zh_hans: 基于 Apple Speech 和 Translation 框架。 所有处理均在设备端完成。

source: Privacy
zh_hans: 隐私

source: Ready
zh_hans: 就绪

source: Real-time subtitles from system audio. On-device speech recognition and translation.
zh_hans: 实时字幕，源自系统音频。 设备端语音识别与翻译。

source: Recognition Engine
zh_hans: 识别引擎

source: Recognition Language
zh_hans: 识别语言

source: Refresh
zh_hans: 刷新

source: Refresh Status
zh_hans: 刷新状态

source: Remove Model
zh_hans: 移除模型

source: Request Permission
zh_hans: 请求权限

source: Restart Now
zh_hans: 立即重启

source: Screen Recording permission required. Click below to trigger the system permission dialog, then grant access.
zh_hans: 需要屏幕录制权限。请点击下方按钮触发系统权限对话框，然后授予访问权限。

source: Select an app…
zh_hans: 选择应用…

source: Setup Guide
zh_hans: 设置指南

source: Show Chinese Translation
zh_hans: 显示中文翻译

source: Show Overlay
zh_hans: 显示字幕

source: Smaller Chinese text shown below English subtitles.
zh_hans: 在英文字幕下方显示较小的中文翻译。

source: Speech
zh_hans: 语音

source: Start
zh_hans: 开始

source: Status
zh_hans: 状态

source: Stop
zh_hans: 停止

source: Subtitle Overlay
zh_hans: 字幕叠加

source: System Default
zh_hans: 系统默认

source: Translate To
zh_hans: 翻译为

source: Translation models not installed. Open System Settings → General → Language & Region → scroll to bottom → "Translation Languages" → download both "%1$@" and "%2$@".
zh_hans: 翻译模型未安装。打开系统设置 → 通用 → 语言与地区 → 滚动到底部 →"翻译语言"→ 下载"%1$@"和"%2$@"。

source: Troubleshooting
zh_hans: 故障排除

source: UI Language
zh_hans: 界面语言

source: Unavailable
zh_hans: 不可用

source: Version 1.0
zh_hans: 版本 1.0

source: Whisper (Custom Model)
zh_hans: Whisper（自定义模型）

source: Whisper Model
zh_hans: Whisper 模型

source: Whisper models can be downloaded from HuggingFace (ggerganov/whisper.cpp). Recommended: ggml-tiny.en.bin or ggml-base.en.bin for real-time use. To integrate whisper.cpp: add package https://github.com/ggerganov/whisper.cpp in Xcode → File → Add Package Dependencies.
zh_hans: Whisper 模型可从 HuggingFace (ggerganov/whisper.cpp) 下载。 推荐用于实时场景：ggml-tiny.en.bin 或 ggml-base.en.bin。 集成 whisper.cpp：在 Xcode → File → Add Package Dependencies 中添加 https://github.com/ggerganov/whisper.cpp。
